Tekla Open API Reference for Tekla Structures 2025
Picker.PickObject Method
Overload List
Name | Description
PickObject(String)
 Requests the user to pick one object. Returns the picked drawing object and the view in which the pick occurred.
PickObject(String, DrawingObject, ViewBase)
 Requests the user to pick one object.
PickObject(String, DrawingObject, ViewBase, Point)
 Requests the user to pick one object. Returns the picked point in addition to the picked object.
PickObject(String, Type[], DrawingObject, ViewBase, Point)
 Requests the user to pick one object of the given types. Returns the picked point in addition to the picked object.
Top
See Also
Reference
Picker Class
Tekla.Structures.Drawing.UI Namespace